emsesp/EMS-ESP32/src/core/emsdevice.h
/*
 * EMS-ESP - https://github.com/emsesp/EMS-ESP
 * Copyright 2020-2025  emsesp.org
 * 
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#ifndef EMSESP_EMSDEVICE_H_
#define EMSESP_EMSDEVICE_H_

#include "emsfactory.h"
#include "telegram.h"
#include "mqtt.h"
#include "helpers.h"
#include "emsdevicevalue.h"

#include <esp32-psram.h>
#include <initializer_list>
#include <map>

namespace emsesp {

class EMSdevice {
  public:
    virtual ~EMSdevice() = default; // destructor of base class must always be virtual because it's a polymorphic class

    // Raw function pointer + EMSdevice* context, instead of std::function.
    // Each std::function<void(...)> typically heap-allocates its capture (a few
    // bytes for the [&] closure) on libstdc++ ESP32 builds. With hundreds of
    // registered telegram handlers across devices, that's tens of KB of
    // long-lived heap. The MAKE_PF_CB macro produces a non-capturing trampoline
    // that decays to this raw pointer (zero heap, zero indirection beyond the
    // call itself). The first parameter receives `this` of the dispatching
    // EMSdevice instance; the trampoline downcasts to the actual derived type.
    using process_function_p = void (*)(EMSdevice * dev, const std::shared_ptr<const Telegram> & t);

    // device_type defines which derived class to use, e.g. BOILER, THERMOSTAT etc..
    EMSdevice(uint8_t device_type, uint8_t device_id, uint8_t product_id, const char * version, const char * default_name, uint8_t flags, uint8_t brand)
        : device_type_(device_type)
        , device_id_(device_id)
        , product_id_(product_id)
        , default_name_(default_name)
        , flags_(flags)
        , brand_(brand) {
        strlcpy(version_, version, sizeof(version_));
    }

    // static functions, used outside the class like in console.cpp, command.cpp, emsesp.cpp, mqtt.cpp
    static const char * device_type_2_device_name(const uint8_t device_type);
    static uint8_t      device_name_2_device_type(const char * topic);
    static const char * tag_to_string(int8_t tag, const bool translate = true);
    static const char * uom_to_string(uint8_t uom);
    static const char * tag_to_mqtt(int8_t tag);
    static uint8_t      decode_brand(uint8_t value);
    static bool         export_values(uint8_t device_type, JsonObject output, const int8_t id, const uint8_t output_target);
    static uint8_t      tag_to_flag(const uint8_t tag);

    // non static functions

    const char * device_type_name();                     // returns short non-translated device type name
    const char * device_type_2_device_name_translated(); // returns translated device type name
    bool         has_tags(const int8_t tag) const;
    bool         has_cmd(const char * cmd, const int8_t id) const;
    std::string  brand_to_char();
    const char * brand_to_cstr() const;
    std::string  to_string();
    std::string  to_string_short();
    std::string  to_string_version();
    std::string  name(); // returns either default or custom name of a device (if defined)

    bool is_device_id(uint8_t device_id) const {
        return ((device_id & 0x7F) == (device_id_ & 0x7F));
    }

    // Getters
    uint8_t device_id() const {
        return device_id_;
    }

    uint8_t product_id() const {
        return product_id_;
    }

    uint8_t device_type() const {
        return device_type_; // see enum DeviceType below
    }

    const char * version() const {
        return version_;
    }

    void version(const char * version) {
        strlcpy(version_, version, sizeof(version_));
    }

    uint8_t brand() const {
        return brand_;
    }

    void active(bool active) {
        active_ = active;
    }

    const char * default_name() const {
        return default_name_;
    }

    // flags
    inline void add_flags(uint8_t flags) {
        flags_ |= flags;
    }
    inline bool has_flags(uint8_t flags) const {
        return (flags_ & flags) == flags;
    }
    inline void remove_flags(uint8_t flags) {
        flags_ &= ~flags;
    }
    inline uint8_t flags() const {
        return flags_;
    }

    // set custom device name
    void custom_name(std::string const & custom_name) {
        custom_name_ = custom_name;
    }

    const std::string & custom_name() const {
        return custom_name_;
    }

    // set custom brand
    void custom_brand(std::string const & custom_brand) {
        custom_brand_ = custom_brand;
    }

    const std::string & custom_brand() const {
        return custom_brand_;
    }
    // set device model
    void model(std::string const & model) {
        model_ = model;
    }

    const std::string & model() const {
        return model_;
    }

    inline uint8_t unique_id() const {
        return unique_id_;
    }

    void unique_id(uint8_t unique_id) {
        unique_id_ = unique_id;
    }

    bool has_update() const {
        return has_update_;
    }

    void has_update(bool flag) {
        has_update_ = flag;
    }

    void has_update(void * value) {
        has_update_ = true;
        publish_value(value);
    }

    void has_update(char * value, const char * newvalue, size_t len) {
        if (value && newvalue && strcmp(value, newvalue) != 0) {
            strlcpy(value, newvalue, len);
            has_update_ = true;
            publish_value(value);
        }
    }

    void has_update(uint8_t & value, uint8_t newvalue) {
        if (value != newvalue) {
            value       = newvalue;
            has_update_ = true;
            publish_value((void *)&value);
        }
    }

    void has_update(uint16_t & value, uint16_t newvalue) {
        if (value != newvalue) {
            value       = newvalue;
            has_update_ = true;
            publish_value((void *)&value);
        }
    }

    void has_update(int16_t & value, int16_t newvalue) {
        if (value != newvalue) {
            value       = newvalue;
            has_update_ = true;
            publish_value((void *)&value);
        }
    }

    void has_update(uint32_t & value, uint32_t newvalue) {
        if (value != newvalue) {
            value       = newvalue;
            has_update_ = true;
            publish_value((void *)&value);
        }
    }

    void has_enumupdate(const std::shared_ptr<const Telegram> & telegram, uint8_t & value, const uint8_t index, int8_t s = 0) {
        if (telegram->read_enumvalue(value, index, s)) {
            has_update_ = true;
            publish_value((void *)&value);
        }
    }

    // maskIn is taken as a std::initializer_list so brace-list call sites
    // like has_enumupdate(t, v, idx, {0,5,1,2,4}) avoid the per-call
    // heap allocation of a temporary std::vector<uint8_t>. The backing
    // array of an initializer_list of integral constants is placed in
    // static storage or on the stack — never on the heap.
    void has_enumupdate(const std::shared_ptr<const Telegram> & telegram, uint8_t & value, const uint8_t index, std::initializer_list<uint8_t> maskIn) {
        uint8_t val = value < maskIn.size() ? *(maskIn.begin() + value) : EMS_VALUE_UINT8_NOTSET;
        if (telegram->read_value(val, index)) {
            uint8_t i = 0;
            for (auto m : maskIn) {
                if (val == m) {
                    value       = i;
                    has_update_ = true;
                    publish_value((void *)&value);
                    return;
                }
                ++i;
            }
        }
    }

    template <typename Value>
    void has_update(const std::shared_ptr<const Telegram> & telegram, Value & value, const uint8_t index, uint8_t s = 0) {
        if (telegram->read_value(value, index, s)) {
            has_update_ = true;
            publish_value((void *)&value);
        }
    }

    template <typename BitValue>
    void has_bitupdate(const std::shared_ptr<const Telegram> & telegram, BitValue & value, const uint8_t index, uint8_t b) {
        if (telegram->read_bitvalue(value, index, b)) {
            has_update_ = true;
            publish_value((void *)&value);
        }
    }

    // modbus
    int get_modbus_value(uint8_t tag, const std::string & shortname, std::vector<uint16_t> & result);
    int modbus_value_to_json(uint8_t tag, const std::string & shortname, const std::vector<uint8_t> & modbus_data, JsonObject jsonValue);

    enum Handlers : uint8_t { ALL, RECEIVED, FETCHED, PENDING, IGNORED };
    void   show_telegram_handlers(uuid::console::Shell & shell) const;
    char * show_telegram_handlers(char * result, const size_t len, const uint8_t handlers);
    void   show_mqtt_handlers(uuid::console::Shell & shell) const;
    void   add_handlers_ignored(const uint16_t handler);

    void set_climate_minmax(int8_t tag, int16_t min, uint32_t max);
    void setValueEnum(const void * value_p, const char * const ** options);
    void setCustomizationEntity(const std::string & entity_id);
    void getCustomizationEntities(std::vector<std::string> & entity_ids);

    void register_telegram_type(const uint16_t telegram_type_id, const char * telegram_type_name, bool fetch, const process_function_p cb, uint8_t length = 0);
    bool handle_telegram(const std::shared_ptr<const Telegram> & telegram);

    std::string get_value_uom(const std::string & shortname) const;
    bool        get_value_info(JsonObject root, const char * cmd, const int8_t id);
    void        get_value_json(JsonObject output, DeviceValue & dv);
    std::string get_metrics_prometheus(const int8_t tag = -1);
    void        get_dv_info(JsonObject json);

    enum OUTPUT_TARGET : uint8_t { API_VERBOSE, API_SHORTNAMES, MQTT, CONSOLE };
    bool generate_values(JsonObject output, const int8_t tag_filter, const bool nested, const uint8_t output_target);
    void generate_values_web(JsonObject output, const bool is_dashboard = false);
    void generate_values_web_customization(JsonArray output);

