emsesp/EMS-ESP32/src/core/emsdevice.h
    void add_device_value(int8_t                 tag,
                          void *                 value_p,
                          uint8_t                type,
                          const char * const **  options,
                          const char * const *   options_single,
                          int8_t                 numeric_operator,
                          const char * const *   name,
                          uint8_t                uom,
                          const cmd_function_p & f,
                          int16_t                min,
                          uint32_t               max);

    void register_device_value(int8_t                 tag,
                               void *                 value_p,
                               uint8_t                type,
                               const char * const **  options,
                               const char * const *   name,
                               uint8_t                uom,
                               const cmd_function_p & f,
                               int16_t                min,
                               uint32_t               max);

    void erase_device_values();

    void
    register_device_value(int8_t tag, void * value_p, uint8_t type, const char * const ** options, const char * const * name, uint8_t uom, const cmd_function_p & f);

    void register_device_value(int8_t tag, void * value_p, uint8_t type, const char * const ** options, const char * const * name, uint8_t uom);

    void register_device_value(int8_t                 tag,
                               void *                 value_p,
                               uint8_t                type,
                               int8_t                 numeric_operator,
                               const char * const *   name,
                               uint8_t                uom,
                               const cmd_function_p & f = nullptr);

    void register_device_value(int8_t                 tag,
                               void *                 value_p,
                               uint8_t                type,
                               int8_t                 numeric_operator,
                               const char * const *   name,
                               uint8_t                uom,
                               const cmd_function_p & f,
                               int16_t                min,
                               uint32_t               max);

    // single list of options
    void register_device_value(int8_t                 tag,
                               void *                 value_p,
                               uint8_t                type,
                               const char * const *   options_single,
                               const char * const *   name,
                               uint8_t                uom,
                               const cmd_function_p & f = nullptr);

    // single list of options, with no translations, with min and max
    void register_device_value(int8_t                 tag,
                               void *                 value_p,
                               uint8_t                type,
                               const char * const *   options_single,
                               const char * const *   name,
                               uint8_t                uom,
                               const cmd_function_p & f,
                               int16_t                min,
                               uint32_t               max);

    // no options, optional function f
    void register_device_value(int8_t tag, void * value_p, uint8_t type, const char * const * name, uint8_t uom, const cmd_function_p & f = nullptr);

    // no options, with min/max
    void
    register_device_value(int8_t tag, void * value_p, uint8_t type, const char * const * name, uint8_t uom, const cmd_function_p & f, int16_t min, uint32_t max);

    void write_command(const uint16_t type_id, const uint8_t offset, uint8_t * message_data, const uint8_t message_length, const uint16_t validate_typeid) const;
    void write_command(const uint16_t type_id, const uint8_t offset, const uint8_t value, const uint16_t validate_typeid) const;
    void write_command(const uint16_t type_id, const uint8_t offset, const uint8_t value) const;

    void read_command(const uint16_t type_id, uint8_t offset = 0, uint8_t length = 0) const;

    bool         is_readable(const void * value_p) const;
    bool         is_readonly(const std::string & cmd, const int8_t id) const;
    bool         has_command(const void * value_p) const;
    void         set_minmax(const void * value_p, int16_t min, uint32_t max);
    void         publish_value(void * value_p) const;
    void         publish_all_values();
    void         mqtt_ha_entity_config_create();
    const char * telegram_type_name(const std::shared_ptr<const Telegram> & telegram);
    void         fetch_values();
    void         toggle_fetch(uint16_t telegram_id, bool toggle);
    bool         is_fetch(uint16_t telegram_id, uint8_t len = 0) const;
    bool         is_received(uint16_t telegram_id) const;
    bool         has_telegram_id(uint16_t id) const;
    void         ha_config_clear();

    bool ha_config_done() const {
        return ha_config_done_;
    }
    void ha_config_done(const bool v) {
        ha_config_done_ = v;
    }

    enum Brand : uint8_t {
        NO_BRAND = 0, // 0
        BOSCH,        // 1
        JUNKERS,      // 2
        BUDERUS,      // 3
        NEFIT,        // 4
        SIEGER,       // 5
        WORCESTER,    // 11
        IVT           // 13
    };

    // Unique Identifiers for each Device type, used in Dashboard table
    // 100 and above is reserved for DeviceType
    enum DeviceTypeUniqueID : uint8_t {
        COMMAND_UID           = 95,
        SCHEDULER_UID         = 96,
        ANALOGSENSOR_UID      = 97,
        TEMPERATURESENSOR_UID = 98,
        CUSTOM_UID            = 99 // always 99
    };

    enum DeviceType : uint8_t {
        SYSTEM = 0,        // this is us (EMS-ESP)
        TEMPERATURESENSOR, // for internal temperature sensors
        ANALOGSENSOR,      // for internal analog sensors
        SCHEDULER,         // for internal schedule
        CUSTOM,            // for user defined entities
        COMMAND,           // for user defined commands
        BOILER,            // from here on enum the ems-devices
        THERMOSTAT,
        MIXER,
        SOLAR,
        HEATPUMP,
        GATEWAY,
        SWITCH,
        CONTROLLER,
        CONNECT,
        ALERT,
        EXTENSION,
        GENERIC,
        HEATSOURCE,
        VENTILATION,
        WATER,
        POOL,
        UNKNOWN
    };

    static constexpr uint8_t EMS_DEVICES_MAX_TELEGRAMS = 20;

    // keep fetching telegrams the bus master doesn't recognise for this long after boot, then give up (in seconds) - 10 minutes
    static constexpr uint32_t FETCH_RETRY_DURATION_SEC = 600;

    // static device IDs
    static constexpr uint8_t EMS_DEVICE_ID_BOILER         = 0x08; // fixed device_id for Master Boiler/UBA
    static constexpr uint8_t EMS_DEVICE_ID_HS1            = 0x70; // fixed device_id for 1st. Cascade Boiler/UBA
    static constexpr uint8_t EMS_DEVICE_ID_HS16           = 0x7F; // fixed device_id for last Cascade Boiler/UBA
    static constexpr uint8_t EMS_DEVICE_ID_AHS1           = 0x60; // fixed device_id for alternative Heating AM200
    static constexpr uint8_t EMS_DEVICE_ID_CONTROLLER     = 0x09;
    static constexpr uint8_t EMS_DEVICE_ID_RS232          = 0x04;
    static constexpr uint8_t EMS_DEVICE_ID_TERMINAL       = 0x0A;
    static constexpr uint8_t EMS_DEVICE_ID_SERVICEKEY     = 0x0B;
    static constexpr uint8_t EMS_DEVICE_ID_CASCADE        = 0x0C;
    static constexpr uint8_t EMS_DEVICE_ID_EASYCOM        = 0x0D;
    static constexpr uint8_t EMS_DEVICE_ID_CONVERTER      = 0x0E;
    static constexpr uint8_t EMS_DEVICE_ID_CLOCK          = 0x0F;
    static constexpr uint8_t EMS_DEVICE_ID_SWITCH         = 0x11; // Switch WM10
    static constexpr uint8_t EMS_DEVICE_ID_ALERT          = 0x12; // Error module EM10
    static constexpr uint8_t EMS_DEVICE_ID_EXTENSION      = 0x15; // Extension module EM1000, Pump module PM10
    static constexpr uint8_t EMS_DEVICE_ID_MODEM          = 0x48;
    static constexpr uint8_t EMS_DEVICE_ID_RFSENSOR       = 0x40; // RF sensor only sending, no reply
    static constexpr uint8_t EMS_DEVICE_ID_RFBASE         = 0x50;
    static constexpr uint8_t EMS_DEVICE_ID_ROOMTHERMOSTAT = 0x17; // TADO using this with no version reply #174
    static constexpr uint8_t EMS_DEVICE_ID_TADO_OLD       = 0x19; // older TADO using this with no version reply, #1031
    static constexpr uint8_t EMS_DEVICE_ID_MIXER1         = 0x20; // e.g MH210 module as mixer
    static constexpr uint8_t EMS_DEVICE_ID_MIXER8         = 0x27;
    static constexpr uint8_t EMS_DEVICE_ID_DHW1           = 0x28; // MM100 module as water station
    static constexpr uint8_t EMS_DEVICE_ID_DHW2           = 0x29; // MM100 module as water station
    static constexpr uint8_t EMS_DEVICE_ID_DHW8           = 0x2F; // last DHW module id?
    static constexpr uint8_t EMS_DEVICE_ID_IPM_DHW        = 0x41; // IPM module as water station
    static constexpr uint8_t EMS_DEVICE_ID_GATEWAY1       = 0x48; // KM200, MX300, MX400
    static constexpr uint8_t EMS_DEVICE_ID_GATEWAY2       = 0x49;
    static constexpr uint8_t EMS_DEVICE_ID_GATEWAY3       = 0x4A;
    static constexpr uint8_t EMS_DEVICE_ID_GATEWAY4       = 0x4B;
    static constexpr uint8_t EMS_DEVICE_ID_GATEWAY5       = 0x4C;
    static constexpr uint8_t EMS_DEVICE_ID_GATEWAY6       = 0x4D;
    static constexpr uint8_t EMS_DEVICE_ID_GATEWAY7       = 0x4E;
    static constexpr uint8_t EMS_DEVICE_ID_GATEWAY8       = 0x4F;

    // generic type IDs
    static constexpr uint16_t EMS_TYPE_NAME        = 0x01; // device config for ems devices, name ascii on offset 27ff  for ems+
    static constexpr uint16_t EMS_TYPE_VERSION     = 0x02; // type ID for Version information. Generic across all EMS devices.
    static constexpr uint16_t EMS_TYPE_UBADevices  = 0x07; // EMS connected devices
    static constexpr uint16_t EMS_TYPE_DEVICEERROR = 0xBE;
    static constexpr uint16_t EMS_TYPE_SYSTEMERROR = 0xBF;
    static constexpr uint16_t EMS_TYPE_MENUCONFIG  = 0xF7;
    static constexpr uint16_t EMS_TYPE_VALUECONFIG = 0xF9;

    // device flags: The lower 4 bits hold the unique identifier, the upper 4 bits are used for specific flags
    static constexpr uint8_t EMS_DEVICE_FLAG_NONE = 0;

