emsesp/EMS-ESP32/src/core/emsdevice.h
    // Controller
    static constexpr uint8_t EMS_DEVICE_FLAG_IVT = 1;

    // Boiler
    static constexpr uint8_t EMS_DEVICE_FLAG_EMS      = 1;
    static constexpr uint8_t EMS_DEVICE_FLAG_EMSPLUS  = 2;
    static constexpr uint8_t EMS_DEVICE_FLAG_HT3      = 3;
    static constexpr uint8_t EMS_DEVICE_FLAG_HYBRID   = 4;
    static constexpr uint8_t EMS_DEVICE_FLAG_HIU      = 5;
    static constexpr uint8_t EMS_DEVICE_FLAG_HEATPUMP = 8; // use bit for subtypes
    static constexpr uint8_t EMS_DEVICE_FLAG_CS6800   = 9; // subtype of heatpump

    // Solar Module
    static constexpr uint8_t EMS_DEVICE_FLAG_SM10  = 1;
    static constexpr uint8_t EMS_DEVICE_FLAG_SM100 = 2;
    static constexpr uint8_t EMS_DEVICE_FLAG_ISM   = 3;

    // Mixer Module
    static constexpr uint8_t EMS_DEVICE_FLAG_MMPLUS = 1;
    static constexpr uint8_t EMS_DEVICE_FLAG_MM10   = 2;
    static constexpr uint8_t EMS_DEVICE_FLAG_IPM    = 3;
    static constexpr uint8_t EMS_DEVICE_FLAG_MP     = 4;

    // Thermostats
    static constexpr uint8_t EMS_DEVICE_FLAG_NO_WRITE    = (1 << 7); // last bit
    static constexpr uint8_t EMS_DEVICE_FLAG_JUNKERS_OLD = (1 << 6); // 6th bit set if older models, like FR120, FR100
    static constexpr uint8_t EMS_DEVICE_FLAG_EASY        = 1;
    static constexpr uint8_t EMS_DEVICE_FLAG_RC10        = 2;
    static constexpr uint8_t EMS_DEVICE_FLAG_RC20        = 3;
    static constexpr uint8_t EMS_DEVICE_FLAG_RC20_N      = 4; // Variation on RC20, Older, like ES72
    static constexpr uint8_t EMS_DEVICE_FLAG_RC25        = 5;
    static constexpr uint8_t EMS_DEVICE_FLAG_RC30_N      = 6; // variation on RC30, Newer models
    static constexpr uint8_t EMS_DEVICE_FLAG_RC30        = 7;
    static constexpr uint8_t EMS_DEVICE_FLAG_RC35        = 8;
    static constexpr uint8_t EMS_DEVICE_FLAG_RC300       = 9;
    static constexpr uint8_t EMS_DEVICE_FLAG_RC100       = 10;
    static constexpr uint8_t EMS_DEVICE_FLAG_JUNKERS     = 11;
    static constexpr uint8_t EMS_DEVICE_FLAG_CRF         = 12; // CRF200 only monitor
    static constexpr uint8_t EMS_DEVICE_FLAG_RC100H      = 13; // with humidity
    static constexpr uint8_t EMS_DEVICE_FLAG_BC400       = 14; // mostly like RC300, but some changes
    static constexpr uint8_t EMS_DEVICE_FLAG_R3000       = 15; // Rego3000, same as RC300 with different wwmodes
    static constexpr uint8_t EMS_DEVICE_FLAG_CR120       = 16; // mostly like RC300, but some changes
    static constexpr uint8_t EMS_DEVICE_FLAG_CR11        = 17; // CRF200 only monitor
    static constexpr uint8_t EMS_DEVICE_FLAG_HMC310      = 18;
    static constexpr uint8_t EMS_DEVICE_FLAG_UI800       = 19;

    uint8_t count_entities();
    uint8_t count_entities_fav();
    bool    has_entities() const;

    // Pre-allocate vector capacity to avoid realloc storms during device
    // construction. Realloc here is especially expensive because each entry
    // contains a std::function (heap-allocated functor) and DeviceValue
    // (with std::string member), so growing copies a lot.
    void reserve_device_values(uint16_t elements) {
        devicevalues_.reserve(elements);
    }

    void reserve_telegram_functions(uint8_t elements) {
        telegram_functions_.reserve(elements);
    }

    // release any reserved-but-unused capacity once the entity/telegram set has settled
    void compact() {
        devicevalues_.shrink_to_fit();
        telegram_functions_.shrink_to_fit();
    }

#if defined(EMSESP_STANDALONE)
    struct TelegramFunctionDump {
        uint16_t     type_id_;
        const char * name_;
        bool         fetch_;
        TelegramFunctionDump(uint16_t type_id, const char * name, bool fetch)
            : type_id_(type_id)
            , name_(name)
            , fetch_(fetch) {
        }
    };
    void dump_telegram_info(std::vector<TelegramFunctionDump> & telegram_functions_dump);
    void dump_devicevalue_info();
#endif

  private:
    uint8_t      unique_id_;
    uint8_t      device_type_ = DeviceType::SYSTEM;
    uint8_t      device_id_   = 0;
    uint8_t      product_id_  = 0;
    char         version_[6];
    const char * default_name_;      // the fixed name the EMS model taken from the device library
    std::string  custom_name_  = ""; // custom name
    std::string  custom_brand_ = ""; // custom brand
    std::string  model_        = ""; // model, taken from the 0x01 telegram. see process_deviceName()
    uint8_t      flags_        = 0;
    uint8_t      brand_        = Brand::NO_BRAND;
    bool         active_       = true;

    bool ha_config_done_ = false;
    bool has_update_     = false;

    struct TelegramFunction {
        const uint16_t           telegram_type_id_;   // it's type_id
        const char *             telegram_type_name_; // e.g. RC20Message
        bool                     fetch_;              // if this type_id be queried automatically
        bool                     received_;
        uint8_t                  length_;
        const process_function_p process_function_;

        TelegramFunction(uint16_t telegram_type_id, const char * telegram_type_name, bool fetch, bool received, uint8_t length, const process_function_p process_function)
            : telegram_type_id_(telegram_type_id)
            , telegram_type_name_(telegram_type_name)
            , fetch_(fetch)
            , received_(received)
            , length_(length)
            , process_function_(process_function) {
        }
    };

    std::vector<uint16_t, AllocatorPSRAM<uint16_t>> handlers_ignored_, handlers_broadcasted_, handlers_config_;
#if defined(EMSESP_STANDALONE) || defined(EMSESP_TEST)
  public: // so we can call it from WebCustomizationService::load_test_data() and EMSESP::dump_all_entities()
#endif
    std::vector<TelegramFunction, AllocatorPSRAM<TelegramFunction>> telegram_functions_; // each EMS device has its own set of registered telegram types
    std::vector<DeviceValue, AllocatorPSRAM<DeviceValue>>           devicevalues_;       // all the device values
};

} // namespace emsesp

#endif
